РасчетныеЗадачиЗанятие4/src/Documents/ПремияРуководителюПодразделения/ПремияРуководителюПодразделения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПремияРуководителюПодразделения</name>
  <registerRecords>CalculationRegister.ДополнительныеНачисления</registerRecords>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерПремии</name>
    <type>
      <types>DefinedType.ПоложительноеЧисло</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеНачисления</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодДействияНачало</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодДействияКонец</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодНачало</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодКонец</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>DefinedType.ПоложительноеЧисло</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ВидыГрафиковРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>DefinedType.ДенежнаяСумма</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноДней</name>
      <type>
        <types>DefinedType.КоличествоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>Сторно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РасчетныеЗадачиЗанятие4/src/CalculationRegisters/ДополнительныеНачисления/ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>DefinedType.ДенежнаяСумма</types>
    </type>
  </resources>
  <attributes>
    <name>Размер</name>
    <type>
      <types>DefinedType.ПоложительноеЧисло</types>
    </type>
  </attributes>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

РасчетныеЗадачиЗанятие4/src/Enums/СпособыРасчета/СпособыРасчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРасчета</name>
  <enumValues>
    <name>ФиксированнойСуммой</name>
  </enumValues>
  <enumValues>
    <name>Процентом</name>
  </enumValues>
  <enumValues>
    <name>ПоМесячнойТарифнойСтавкеПоДням</name>
  </enumValues>
  <enumValues>
    <name>ПоСреднемуЗаработку</name>
  </enumValues>
  <enumValues>
    <name>НулеваяСумма</name>
  </enumValues>
  <enumValues>
    <name>ПоФормуле</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияЗаДень</name>
  </enumValues>
</mdclass:Enum>

РасчетныеЗадачиЗанятие4/src/ChartsOfCalculationTypes/ДополнительныеНачисления/ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ДополнительныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.ДополнительныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>ПремияПроцентом</name>
      <description>Премия процентом</description>
    </items>
    <items>
      <name>ПремияРуководителю</name>
      <description>Премия руководителю</description>
    </items>
    <items>
      <name>ПремияСуммой</name>
      <description>Премия суммой</description>
    </items>
  </predefined>
  <attributes>
    <name>СпособРасчета</name>
    <type>
      <types>EnumRef.СпособыРасчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетСбораБазы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

РасчетныеЗадачиЗанятие4/src/Documents/ПремияРуководителюПодразделения/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	ЗаполнитьНаборЗаписей_ДополнительныеНачисления();
	
	Движения.ДополнительныеНачисления.Записывать = Истина;
	Движения.Записать();
	
	РассчитатьРесурсы_ДополнительныеНачисления();

КонецПроцедуры

Процедура ЗаполнитьНаборЗаписей_ДополнительныеНачисления()
    
    Движение = Движения.ДополнительныеНачисления.Добавить();
	
	Движение.Сторно = Ложь;
    Движение.ВидРасчета = ПланыВидовРасчета.ДополнительныеНачисления.ПремияРуководителю;
    
    Движение.ПериодРегистрации = ПериодРегистрации;
    
    Движение.БазовыйПериодНачало = ДобавитьМесяц(ПериодРегистрации,-1);
    Движение.БазовыйПериодКонец = ПериодРегистрации -1;
    
    Движение.ФизическоеЛицо = ФизическоеЛицо;
    Движение.Подразделение = Подразделение;
    Движение.Должность = Должность;
    Движение.Результат = 0;
    Движение.Размер = РазмерПремии;
    
КонецПроцедуры

Процедура РассчитатьРесурсы_ДополнительныеНачисления()
	
	НаборЗаписей = Движения.ДополнительныеНачисления;
	
	//Получаем упорядоченные по категориям данные текущего набора записей, записанные в БД
	Менеджер = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Менеджер;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
	|	ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
	|	ДополнительныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
	|	ДополнительныеНачисления.Регистратор КАК Регистратор,
	|	ДополнительныеНачисления.БазовыйПериодНачало КАК БазовыйПериодНачало,
	|	ДополнительныеНачисления.БазовыйПериодКонец КАК БазовыйПериодКонец,
	|	ДополнительныеНачисления.Активность КАК Активность,
	|	ДополнительныеНачисления.Сторно КАК Сторно,
	|	ДополнительныеНачисления.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДополнительныеНачисления.Подразделение КАК Подразделение,
	|	ДополнительныеНачисления.Должность КАК Должность,
	|	ДополнительныеНачисления.Результат КАК Результат,
	|	ДополнительныеНачисления.Размер КАК Размер
	|ПОМЕСТИТЬ ВТДвижения
	|ИЗ
	|	РегистрРасчета.ДополнительныеНачисления КАК ДополнительныеНачисления
	|ГДЕ
	|	ДополнительныеНачисления.Регистратор = &Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДополнительныеНачисления.ВидРасчета КАК ВидРасчета
	|ПОМЕСТИТЬ ВТВидыРасчетаДокумента
	|ИЗ
	|	ВТДвижения КАК ДополнительныеНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТВидыРасчетаДокумента.ВидРасчета КАК ВидРасчета,
	|	ДополнительныеНачисленияВедущиеВидыРасчета.ВидРасчета КАК ВедущийВидРасчета
	|ПОМЕСТИТЬ ВТВедущиеВидыРасчета
	|ИЗ
	|	ВТВидыРасчетаДокумента КАК ВТВидыРасчетаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ДополнительныеНачисления.ВедущиеВидыРасчета КАК ДополнительныеНачисленияВедущиеВидыРасчета
	|		ПО ВТВидыРасчетаДокумента.ВидРасчета = ДополнительныеНачисленияВедущиеВидыРасчета.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТВедущиеВидыРасчета.ВидРасчета КАК ВидРасчета,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТВидыРасчетаДокумента.ВидРасчета) КАК Приоритет
	|ПОМЕСТИТЬ ВТПриоритетыВидовРасчета
	|ИЗ
	|	ВТВедущиеВидыРасчета КАК ВТВедущиеВидыРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыРасчетаДокумента КАК ВТВидыРасчетаДокумента
	|		ПО ВТВедущиеВидыРасчета.ВедущийВидРасчета = ВТВидыРасчетаДокумента.ВидРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТВедущиеВидыРасчета.ВидРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПриоритетыВидовРасчета.Приоритет КАК Приоритет,
	|	ВТДвижения.НомерСтроки КАК НомерСтроки,
	|	ВТДвижения.ВидРасчета КАК ВидРасчета,
	|	ВТДвижения.ПериодРегистрации КАК ПериодРегистрации,
	|	ВТДвижения.Регистратор КАК Регистратор,
	|	ВТДвижения.БазовыйПериодНачало КАК БазовыйПериодНачало,
	|	ВТДвижения.БазовыйПериодКонец КАК БазовыйПериодКонец,
	|	ВТДвижения.Активность КАК Активность,
	|	ВТДвижения.Сторно КАК Сторно,
	|	ВТДвижения.ФизическоеЛицо,
	|	ВТДвижения.Подразделение КАК Подразделение,
	|	ВТДвижения.Должность КАК Должность,
	|	ВТДвижения.Результат КАК Результат,
	|	ВТДвижения.Размер КАК Размер
	|ПОМЕСТИТЬ ВТДвиженияСПриоритетом
	|ИЗ
	|	ВТДвижения КАК ВТДвижения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПриоритетыВидовРасчета КАК ВТПриоритетыВидовРасчета
	|		ПО ВТДвижения.ВидРасчета = ВТПриоритетыВидовРасчета.ВидРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДвиженияСПриоритетом.НомерСтроки КАК НомерСтроки,
	|	ВТДвиженияСПриоритетом.ВидРасчета КАК ВидРасчета,
	|	ВТДвиженияСПриоритетом.ВидРасчета.СпособРасчета КАК СпособРасчета,
	|	ВТДвиженияСПриоритетом.Приоритет КАК Приоритет
	|ИЗ
	|	ВТДвиженияСПриоритетом КАК ВТДвиженияСПриоритетом
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДвижения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТВидыРасчетаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТВедущиеВидыРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПриоритетыВидовРасчета";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПриоритет = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//Внешний цикл по категориям
	Пока ВыборкаПриоритет.Следующий() Цикл
		
		//Вложенный цикл по записям текущей категории
		ВыборкаДетальныеЗаписи = ВыборкаПриоритет.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Запись = НаборЗаписей.Получить(ВыборкаДетальныеЗаписи.НомерСтроки - 1);
			
			Если ВыборкаДетальныеЗаписи.СпособРасчета = Перечисления.СпособыРасчета.Процентом Тогда
				
				База = 9999;

				ПроцентВыплаты = Запись.Размер;

				Запись.Результат = База * ПроцентВыплаты / 100;
				
			КонецЕсли;
			
		КонецЦикла;
		
		НаборЗаписей.Записать(,Истина);
		
	КонецЦикла;
	
	

КонецПроцедуры
